# Copyright 2021 MobiledgeX, Inc. All rights and licenses reserved.
# MobiledgeX, Inc. 156 2nd Street #408, San Francisco, CA 94105
#
# Licensed under the Apache License, Version 2.0 (the "License");
# you may not use this file except in compliance with the License.
# You may obtain a copy of the License at
#
#     http://www.apache.org/licenses/LICENSE-2.0
#
# Unless required by applicable law or agreed to in writing, software
# distributed under the License is distributed on an "AS IS" BASIS,
# WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
# See the License for the specific language governing permissions and
# limitations under the License.

name: "ensemble_dali_yolov4"
platform: "ensemble"
max_batch_size: 1
input [
  {
    name: "IMAGE"
    data_type: TYPE_UINT8
    dims: [ -1 ]
  }
]
output [
  {
    name: "OBJECTS_JSON"
    data_type: TYPE_STRING
    dims: [ -1 ]
  }
]
ensemble_scheduling {
  step [
    {
      model_name: "yolov4_preprocess"
      model_version: -1
      input_map {
        key: "RAW_IMAGE"
        value: "IMAGE"
      }
      output_map {
        key: "PREPROCESSED_OUTPUT"
        value: "PREPROCESSED_IMAGE"
      }
    },
    {
      model_name: "yolov4"
      model_version: -1
      input_map {
        key: "data"
        value: "PREPROCESSED_IMAGE"
      }
      output_map {
        key: "prob"
        value: "OBJECT_DETECTIONS"
      }
    },
    {
      model_name: "yolov4_parser"
      model_version: -1
      input_map {
        key: "prob"
        value: "OBJECT_DETECTIONS"
      }
      output_map {
        key: "DETECTED_OBJECTS_JSON"
        value: "OBJECTS_JSON"
      }
    }
  ]
}
